In [1]:
import pandas as pd
employee = pd.read_table('/Users/ryanheadley/Documents/GitHub/Development/Udemy/Learn Data Analysis using Pandas and Python (2|3)/ressources/DataTables example - Tab separated values.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

### Loc is used to choose number of rows and columns

In [2]:
#row 0, all columns
employee.loc[0,:]

Name          Airi Satou
Position      Accountant
Office             Tokyo
Age                   33
Start date    2008/11/28
Salary          $162,700
Name: 0, dtype: object

In [3]:
#row 0-2, all columns
employee.loc[0:2, :]

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"

In [4]:
#rows 0-2, 2 columns
employee.loc[0:2,['Name','Position']]

             Name                       Position
0      Airi Satou                     Accountant
1  Angelica Ramos  Chief Executive Officer (CEO)
2      Ashton Cox        Junior Technical Author

In [5]:
#rows 0-2, columns 0-3
employee.loc[0:2,'Name':'Office']

             Name                       Position         Office
0      Airi Satou                     Accountant          Tokyo
1  Angelica Ramos  Chief Executive Officer (CEO)         London
2      Ashton Cox        Junior Technical Author  San Francisco

In [6]:
#rows with conditions
employee.loc[employee.Position == 'Accountant', :]

               Name    Position Office  Age  Start date    Salary
0        Airi Satou  Accountant  Tokyo   33  2008/11/28  $162,700
17  Garrett Winters  Accountant  Tokyo   63  2011/07/25  $170,750

### Dropna is used to drop rows with missing values

In [7]:
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

Now duplicate employee file has been creating with missing values in various rows.

*NaN* stands for Not a Number

In [10]:
employee = pd.read_table('/Users/ryanheadley/Documents/GitHub/Development/Udemy/Learn Data Analysis using Pandas and Python (2|3)/ressources/DataTables example - Tab separated values_missing.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,NaN,33.0,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47.0,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,NaN,2009/01/12,"$86,000"
3,NaN,Software Engineer,London,41.0,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28.0,2011/06/07,"$206,850"

In [11]:
employee.shape

(57, 6)

In [12]:
#drop rows with all missing values in every column
employee.dropna(how='any').shape

(54, 6)

In [13]:
#drop rows with all missing values in certain columns
employee.dropna(subset=['Name','Salary'],how='any').shape

(56, 6)